<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Cricut Design Space web plugin installer, imports into Munki.</string>
    <key>Identifier</key>
    <string>com.andrewzirkel.munki.CricutDesignSpace</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CricutDesignSpace</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/cricut</string>
        <key>MAKEPKGINFO_PKGNAME</key>
        <string>Install Cricut Design Space web plugin</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Cricut Design Space web plugin for use with Cricut Printers.</string>
            <key>display_name</key>
            <string>Cricut Design Space</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>developer</key>
            <string>Cricut</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.pkg.CricutDesignSpace</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
        <key>Arguments</key>
        <dict>
          <key>additional_pkginfo</key>
          <dict>
            <key>preinstall_script</key>
            <string>#!/bin/sh

#See if there is a user logged in
loggedin=$(defaults read /Library/Preferences/com.apple.loginwindow lastUser)

if [ "$loggedin" == "loggedIn" ]; then
  exit 0
fi

exit 1
</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
#script should only run if a user is logged in, as checked in pre-install script.

# Run installer
/private/tmp/CricutDesignSpace.app/Contents/MacOS/osx-x86_64 --mode unattended

# Clean up
rm -rf /private/tmp/CricutDesignSpace.app
</string>
          </dict>
        </dict>
      </dict>
      <dict>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%pkg_path%</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
              <key>munkiimport_pkgname</key>
              <string>%MAKEPKGINFO_PKGNAME%</string>
          </dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
      </dict>
    </array>
</dict>
</plist>
