<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Cricut Design Space web plugin installer, imports into Munki.</string>
    <key>Identifier</key>
    <string>com.andrewzirkel.munki.CricutDesignSpace</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CricutDesignSpace</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/cricut</string>
        <key>MAKEPKGINFO_PKGNAME</key>
        <string>Install Cricut Design Space web plugin</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Cricut Design Space web plugin for use with Cricut Printers.</string>
            <key>display_name</key>
            <string>Cricut Design Space</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>developer</key>
            <string>Cricut</string>
            <key>category</key>
            <string>Extras</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.CricutDesignSpace</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%pathname%</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
              <key>munkiimport_pkgname</key>
              <string>%MAKEPKGINFO_PKGNAME%</string>
          </dict>
      </dict>
    </array>
</dict>
</plist>
