<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads Lightspeed Relay Smart Agent.</string>
    <key>Identifier</key>
    <string>com.andrewzirkel.download.LightspeedRelaySmartAgent</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>LightspeedRelaySmartAgent</string>
      <key>DOWNLOAD_URL</key>
  		<string>https://OverrideThisWithYourOrgsURL/SmartAgent.dmg</string>
    </dict>
  	<key>MinimumVersion</key>
  	<string>1.0.0</string>
  	<key>Process</key>
  	<array>
      <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
              <key>filename</key>
              <string>%NAME%.dmg</string>
              <key>url</key>
              <string>%DOWNLOAD_URL%</string>
          </dict>
        </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
