<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SMART Screen Share and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.andrewzirkel.munki.SMARTScreenShare</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>SMARTScreenShare</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_DEVELOPER</key>
		<string>SMART Technologies ULC</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>SMART Screen Share app for macOS computers
The is an alternate method of sharing your device’s screen and might be useful where the network your display is connected to doesn’t support AirPlay, Google Cast, or Miracast.
https://support.smarttech.com/docs/software/iq/en/downloads/screen-share-apps/macos.cshtml</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>display_name</key>
			<string>SMART Screen Share</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

		cp -r /Applications/SMART\ Screen\ Share.app/Contents/Resources/User-Space/SMARTLoopbackAudioDriver.driver /Library/Audio/Plug-Ins/HAL/

		launchctl stop com.apple.audio.coreaudiod
		launchctl start com.apple.audio.coreaudiod

		exit 0</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.andrewzirkel.download.SMARTScreenShare</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
