<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Screencast-O-Matic and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.andrewzirkel.munki.Screencast-O-Matic</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Screencast-O-Matic v2.0</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Screencast-O-Matic</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Screencast-O-Matic is a screen capture and video service, taking visual collaboration to the next level.  It allows individuals, learning institutions, and companies to create video solutions for learning and collaboration. </string>
			<key>developer</key>
			<string>Screencast-O-Matic</string>
			<key>category</key>
			<string>Communications</string>
			<key>display_name</key>
			<string>Screencast-O-Matic</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>postinstall_script</key>
<string>#!/bin/bash
#Need write access to app dir.

/bin/chmod -R 777 "/Applications/Screencast-O-Matic v2.0.app"
</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.andrewzirkel.download.Screencast-O-Matic</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
